# Basic Pandas

In [4]:
import pandas as pd

In [5]:
# create data frame from scratch

raw_data = {
    "name": ["Toy" , "Book", "Boon", "Mah","Anna"],
    "age": [33,22,25,35,24],
    "gender": ["M","M","F","M","F"]
}

df = pd.DataFrame(raw_data)
df

,name,age,gender
0,Toy,33,M
1,Book,22,M
2,Boon,25,F
3,Mah,35,M
4,Anna,24,F

In [6]:
df['city'] = ['London', 'London', 'London', 'ManChester', 'Liverpool']

In [7]:
df.shape

(5, 4)

In [8]:
df = df.drop('city', axis=1)

In [9]:
df

,name,age,gender
0,Toy,33,M
1,Book,22,M
2,Boon,25,F
3,Mah,35,M
4,Anna,24,F

In [10]:
df = df.drop(2, axis=0)

In [11]:
df

,name,age,gender
0,Toy,33,M
1,Book,22,M
3,Mah,35,M
4,Anna,24,F

In [12]:
df = df.reset_index(drop= True)

In [13]:
df

,name,age,gender
0,Toy,33,M
1,Book,22,M
2,Mah,35,M
3,Anna,24,F

In [14]:
# column name
list(df.columns)

['name', 'age', 'gender']

In [15]:
df.columns = ['nickname', 'age', 'sex']

In [16]:
df

,nickname,age,sex
0,Toy,33,M
1,Book,22,M
2,Mah,35,M
3,Anna,24,F

In [17]:
type(df['nickname'])

pandas.core.series.Series

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
# create a new series
s1 = pd.Series(['Mary', 20, 'F'], index=['nickname','age','sex'])
print(s1)
print(type(s1))

nickname    Mary
age           20
sex            F
dtype: object
<class 'pandas.core.series.Series'>

In [20]:
#append
df = df.append(s1, ignore_index=True)
df

,nickname,age,sex
0,Toy,33,M
1,Book,22,M
2,Mah,35,M
3,Anna,24,F
4,Mary,20,F

In [21]:
s2 = pd.Series(['London', 'London', 'London', 'ManChester', 'Liverpool'])
df['city'] = s2

In [22]:
df

,nickname,age,sex,city
0,Toy,33,M,London
1,Book,22,M,London
2,Mah,35,M,London
3,Anna,24,F,ManChester
4,Mary,20,F,Liverpool

In [23]:
#write csv firle
df.to_csv('book_data.csv')

In [24]:
#import csv
df2 = pd.read_csv('Data/data.csv')

In [25]:
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [26]:
import pandas as pd

In [27]:
df3 = pd.read_excel('Data/data.xlsx')

In [28]:
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [29]:
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [31]:
p.info()

AttributeError: AttributeError: module 'pandas' has no attribute 'info'